In [2]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
# 2 Data Types
series = pd.Series(["BMW","Honda","Tata"])
series

0      BMW
1    Honda
2     Tata
dtype: object

Series is 1 dimentional

In [4]:
colors = pd.Series(["Red","Black","Blue"])
colors

0      Red
1    Black
2     Blue
dtype: object

DataFrame is 2 dimentional

In [5]:
car_data = pd.DataFrame({"Brand":series,"Colors":colors})
car_data

   Brand Colors
0    BMW    Red
1  Honda  Black
2   Tata   Blue

In [6]:
#Importing Data
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [7]:
# Exporting DataFrame
car_sales.to_csv("exported-car-sales.csv", index=False)

In [8]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describe Data

In [9]:
# Attribute
car_sales.dtypes

# Function
# car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [10]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [11]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [12]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [13]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [14]:
car_sales.mean()

C:\Users\Mas85\AppData\Local\Temp\ipykernel_4396\4073448239.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [15]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [16]:
car_sales["Doors"].sum()

40

In [17]:
len(car_sales)

10

## Viewing and Selecting Data

In [18]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [19]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [20]:
# .loc & .iloc
animals =pd.Series(["Cat","Dog","Snake","Cow","panda"],index=[1,2,3,4,3])
animals

1      Cat
2      Dog
3    Snake
4      Cow
3    panda
dtype: object

In [21]:
# .loc refers to index
animals.loc[3]

3    Snake
3    panda
dtype: object

In [22]:
animals.loc[4]

'Cow'

In [23]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [24]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [25]:
animals

1      Cat
2      Dog
3    Snake
4      Cow
3    panda
dtype: object

In [26]:
# iloc refers to position
animals.iloc[3]

'Cow'

In [27]:
animals.iloc[:3]

1      Cat
2      Dog
3    Snake
dtype: object

In [28]:
animals.iloc[3:]

4      Cow
3    panda
dtype: object

In [29]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [30]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [31]:
car_sales["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [32]:
# Using dot function does not accept space
car_sales.Odometer (KM)

AttributeError: 'DataFrame' object has no attribute 'Odometer'

In [ ]:
car_sales[car_sales["Make"] == "Toyota"]

In [ ]:
car_sales[car_sales["Odometer (KM)"] > 100000]

In [ ]:
# Crosstab is used for aggregate two column
pd.crosstab(car_sales["Make"], car_sales["Doors"])

In [ ]:
# groupby is used for operational function
car_sales.groupby(car_sales["Make"]).mean()

In [ ]:
car_sales["Odometer (KM)"].plot()

In [ ]:
#Histogram
car_sales["Odometer (KM)"].hist()

In [ ]:
# Price column $ and dot replace by empty value and converted to int
car_sales["Price"]= car_sales["Price"].str.replace('[\$\,\.]','').astype(int)

In [ ]:
car_sales

In [ ]:
car_sales["Price"].plot()

## Manupulating Data

In [ ]:
car_sales["Make"].str.lower()

In [ ]:
car_sales

In [ ]:
# You should reassign the change other wise it won't save.
car_sales["Make"] = car_sales["Make"].str.lower()

In [ ]:
car_sales

# Missing Data Filling
car_sales["Odometer"] = car_sales["odometer"].fillna(car_sales["odometer"].mean(),inplace=True)

# To remove missing data from data set
car_sales.dropna(inplace=True)

In [35]:
# Column from Series
seats_column=pd.Series([4,5,5,6,7,5])
# Create a new column named Seats
car_sales["Seats"] = seats_column

In [36]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Seats
0  Toyota  White         150043      4   $4,000.00    4.0
1   Honda    Red          87899      4   $5,000.00    5.0
2  Toyota   Blue          32549      3   $7,000.00    5.0
3     BMW  Black          11179      5  $22,000.00    6.0
4  Nissan  White         213095      4   $3,500.00    7.0
5  Toyota  Green          99213      4   $4,500.00    5.0
6   Honda   Blue          45698      4   $7,500.00    NaN
7   Honda   Blue          54738      4   $7,000.00    NaN
8  Toyota  White          60000      4   $6,250.00    NaN
9  Nissan  White          31600      4   $9,700.00    NaN

In [37]:
car_sales["Seats"].fillna(5,inplace=True)

In [38]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Seats
0  Toyota  White         150043      4   $4,000.00    4.0
1   Honda    Red          87899      4   $5,000.00    5.0
2  Toyota   Blue          32549      3   $7,000.00    5.0
3     BMW  Black          11179      5  $22,000.00    6.0
4  Nissan  White         213095      4   $3,500.00    7.0
5  Toyota  Green          99213      4   $4,500.00    5.0
6   Honda   Blue          45698      4   $7,500.00    5.0
7   Honda   Blue          54738      4   $7,000.00    5.0
8  Toyota  White          60000      4   $6,250.00    5.0
9  Nissan  White          31600      4   $9,700.00    5.0

In [40]:
# Column from python list
fuel=[5.4,6.0,6.4,4.7,7.8,9.0,5.0,6.7,8.8,7.4]
car_sales["Fuel per 100KM"] = fuel

In [41]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Seats  Fuel per 100KM
0  Toyota  White         150043      4   $4,000.00    4.0             5.4
1   Honda    Red          87899      4   $5,000.00    5.0             6.0
2  Toyota   Blue          32549      3   $7,000.00    5.0             6.4
3     BMW  Black          11179      5  $22,000.00    6.0             4.7
4  Nissan  White         213095      4   $3,500.00    7.0             7.8
5  Toyota  Green          99213      4   $4,500.00    5.0             9.0
6   Honda   Blue          45698      4   $7,500.00    5.0             5.0
7   Honda   Blue          54738      4   $7,000.00    5.0             6.7
8  Toyota  White          60000      4   $6,250.00    5.0             8.8
9  Nissan  White          31600      4   $9,700.00    5.0             7.4

In [46]:
car_sales["Total Fuel Used(L)"] = car_sales["Odometer (KM)"] / 100 * car_sales["Fuel per 100KM"]

In [47]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total Fuel Used,Numer of Wheels,Passed Road Safety,Total Fuel Used(L)
0,Toyota,White,150043,4,"$4,000.00",4.0,5.4,8102.322,4,True,8102.322
1,Honda,Red,87899,4,"$5,000.00",5.0,6.0,5273.940,4,True,5273.940
2,Toyota,Blue,32549,3,"$7,000.00",5.0,6.4,2083.136,4,True,2083.136
3,BMW,Black,11179,5,"$22,000.00",6.0,4.7,525.413,4,True,525.413
4,Nissan,White,213095,4,"$3,500.00",7.0,7.8,16621.410,4,True,16621.410
5,Toyota,Green,99213,4,"$4,500.00",5.0,9.0,8929.170,4,True,8929.170
6,Honda,Blue,45698,4,"$7,500.00",5.0,5.0,2284.900,4,True,2284.900
7,Honda,Blue,54738,4,"$7,000.00",5.0,6.7,3667.446,4,True,3667.446
8,Toyota,White,60000,4,"$6,250.00",5.0,8.8,5280.000,4,True,5280.000
9,Nissan,White,31600,4,"$9,700.00",5.0,7.4,2338.400,4,True,2338.400

In [44]:
# Create a coloumn from single value
car_sales["Numer of Wheels"] = 4
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total Fuel Used,Numer of Wheels
0,Toyota,White,150043,4,"$4,000.00",4.0,5.4,8102.322,4
1,Honda,Red,87899,4,"$5,000.00",5.0,6.0,5273.940,4
2,Toyota,Blue,32549,3,"$7,000.00",5.0,6.4,2083.136,4
3,BMW,Black,11179,5,"$22,000.00",6.0,4.7,525.413,4
4,Nissan,White,213095,4,"$3,500.00",7.0,7.8,16621.410,4
5,Toyota,Green,99213,4,"$4,500.00",5.0,9.0,8929.170,4
6,Honda,Blue,45698,4,"$7,500.00",5.0,5.0,2284.900,4
7,Honda,Blue,54738,4,"$7,000.00",5.0,6.7,3667.446,4
8,Toyota,White,60000,4,"$6,250.00",5.0,8.8,5280.000,4
9,Nissan,White,31600,4,"$9,700.00",5.0,7.4,2338.400,4

In [45]:
car_sales["Passed Road Safety"]=True
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total Fuel Used,Numer of Wheels,Passed Road Safety
0,Toyota,White,150043,4,"$4,000.00",4.0,5.4,8102.322,4,True
1,Honda,Red,87899,4,"$5,000.00",5.0,6.0,5273.940,4,True
2,Toyota,Blue,32549,3,"$7,000.00",5.0,6.4,2083.136,4,True
3,BMW,Black,11179,5,"$22,000.00",6.0,4.7,525.413,4,True
4,Nissan,White,213095,4,"$3,500.00",7.0,7.8,16621.410,4,True
5,Toyota,Green,99213,4,"$4,500.00",5.0,9.0,8929.170,4,True
6,Honda,Blue,45698,4,"$7,500.00",5.0,5.0,2284.900,4,True
7,Honda,Blue,54738,4,"$7,000.00",5.0,6.7,3667.446,4,True
8,Toyota,White,60000,4,"$6,250.00",5.0,8.8,5280.000,4,True
9,Nissan,White,31600,4,"$9,700.00",5.0,7.4,2338.400,4,True

In [48]:
car_sales.drop("Total Fuel Used(L)",axis=1)

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total Fuel Used,Numer of Wheels,Passed Road Safety
0,Toyota,White,150043,4,"$4,000.00",4.0,5.4,8102.322,4,True
1,Honda,Red,87899,4,"$5,000.00",5.0,6.0,5273.940,4,True
2,Toyota,Blue,32549,3,"$7,000.00",5.0,6.4,2083.136,4,True
3,BMW,Black,11179,5,"$22,000.00",6.0,4.7,525.413,4,True
4,Nissan,White,213095,4,"$3,500.00",7.0,7.8,16621.410,4,True
5,Toyota,Green,99213,4,"$4,500.00",5.0,9.0,8929.170,4,True
6,Honda,Blue,45698,4,"$7,500.00",5.0,5.0,2284.900,4,True
7,Honda,Blue,54738,4,"$7,000.00",5.0,6.7,3667.446,4,True
8,Toyota,White,60000,4,"$6,250.00",5.0,8.8,5280.000,4,True
9,Nissan,White,31600,4,"$9,700.00",5.0,7.4,2338.400,4,True